Model description of train_v003
_________________________________________________________________

Test loss: 0.03309004632326273
Test accuracy: 0.9415384617218604
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
conv2d_1_input (InputLayer)     (None, 120, 160, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 120, 160, 32) 832         conv2d_1_input[0][0]             
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 60, 80, 32)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 60, 80, 32)   25632       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 30, 40, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 38400)        0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 256)          9830656     flatten_1[0][0]                  
__________________________________________________________________________________________________
dense_4_input (InputLayer)      (None, 15)           0                                            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 256)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 16)           256         dense_4_input[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          32896       dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 8)            136         dense_4[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 3)            387         dense_2[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 3)            27          dense_5[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 6)            0           dense_3[0][0]                    
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 3)            21          concatenate_1[0][0]              
==================================================================================================
Total params: 9,890,843
Trainable params: 9,890,843
Non-trainable params: 0
__________________________________________________________________________________________________
