Model description of generated_less_data
_________________________________________________________________

Test loss: 0.0018771814497227958
Test accuracy: 0.9996691052606247
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 64)                256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 260       
=================================================================
Total params: 4,676
Trainable params: 4,676
Non-trainable params: 0
_________________________________________________________________
