Model description oftrain_v3
_________________________________________________________________
batch size: 16
epochs: 500
_________________________________________________________________

Test loss: 0.11726650703384216
Test accuracy: 0.6626506031277668
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 120, 160, 32)      832       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 60, 80, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 60, 80, 32)        25632     
_________________________________________________________________
average_pooling2d_1 (Average (None, 30, 40, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 30, 40, 64)        51264     
_________________________________________________________________
average_pooling2d_2 (Average (None, 15, 20, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 19200)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               4915456   
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 645       
=================================================================
Total params: 5,026,725
Trainable params: 5,026,725
Non-trainable params: 0
_________________________________________________________________
