Model description oftrain_v108
_________________________________________________________________
batch size: 20
epochs: 20
_________________________________________________________________

Test loss: 0.08845116938435056
Test accuracy: 0.8459119474363027
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 120, 160, 32)      832       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 60, 80, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 60, 80, 32)        25632     
_________________________________________________________________
average_pooling2d_1 (Average (None, 30, 40, 32)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 38400)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               9830656   
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_3 (Dense)              (None, 3)                 387       
=================================================================
Total params: 9,890,403
Trainable params: 9,890,403
Non-trainable params: 0
_________________________________________________________________
